<?php
require_once('./include/db_info.inc.php');
	require_once('./include/cache_start.php');
	require_once('./include/setlang.php');
header("Content-type: text/html; charset=utf-8"); 
//$in = "1140,1656,1117,1155,1156,1160,1162,1163,1653,1136,1137,1154,1158,1139,1157,1171,1172,1654,1655,1174,1175,1176,1177,1142,1143,1145,1147,1148,1149,1151,1179,1120,1121,1123,1124,1125,1126,1661,1662,1663,1664,1665,1666,1200,1201,1127,1128,1129,1130,1131,1132,1133,1134,1135";
//$in = "1157,1171,1172,1654,1655,1174,1175,1176,1177,1142,1143,1145,1147,1148,1149,1151,1179,1120,1121,1123,1124,1125,1126,1661,1662,1663,1664,1665,1666,1200,1201,1127,1128,1129,1130,1131,1132,1133,1134,1135";
//$in = "1148,1149,1151,1123,1124,1125,1126,1661,1662,1663,1664,1665,1666,1200,1201,1128,1130,1131,1132,1133,1134,1135,1164,1165,1166,1167,1168,1170,1257,1258,1259,1181,1267,1374,1182,1375,1265,1268,1118,1119,1270";
//2017-1-22注释
//$in = "1118,1119,1270,1011,1007,1318,1270,1284,1370,1255,1338,1329,1364,1073,1010,1339,1207,1208,1399,1397,1478,1396,1398,1206,1208,1399,1207,1212,1209,1399,1236,1231,1415,1063,1235,1627,1417,1413,1414,1416,1435,1253,1246,1248,1250,1430,1216,1213,1219,1262,1225,1426,1419,1425,1423,1470,1793,1064,1565,1583,1555,1559,1577,1579,1581,1071,1633,1611,1808";
//2017-4-11开始USACO 1205前是USACO题目
$in = "2006,2007,2008,1930,1931,1932,1933,1934,1935,1937,1938,1939,1940,1941,1942,1943,1944,1945,1946,1947,1948,1949,1950,1951,1205,1423,1579,1581,1071,1632,1072,1618,1410,1239,1428,1581,1572,1594,1606,1667";
//原来该做而未做的题目列表1205,1423,1579,1581,1071,1632,1072,1618,1407,1410,1239,1428,1581,1572,1594,1606,1667
//$in = file_get_contents('___problems.txt');
$pid = explode(",",$in);
$pnum = 0;
while($pid[$pnum]>0) $pnum++;

//$users = "罗雨果 20190113,李润峰 20190110,袁晨希 20190125,黄腾昊 20190203,卢泽仁 20161011,游齐宇 20190222,余思源 20190223,万俊宏 20190315,祝渝攀 20190327,樊影 20190331,李知润 20190309,吴仪 20190352,陈缘 20190303,李扬 20190308,杨腾 20190321,王越超 20190319,黄凌霄 20190306,李文翰 20190412,刘季豪 20190414,吴彤 20190419,曾睿然 20191102,尹彦臻 20190556,杨寒羽 20161024,张奇夫 Apache553,何逸霏 20191606";
$users = "李润峰 20190110,黄腾昊 20190203,卢泽仁 20161011,游齐宇 20190222,杨寒羽 20161024,张奇夫 Apache553";
//$users = "李润峰 20190110,黄腾昊 20190203,卢泽仁 20161011,游齐宇 20190222,杨寒羽 20161024,张奇夫 Apache553,黄红伟 MarkBlain";
//$users = file_get_contents('___users.txt');
//var_dump( explode(";",$str));
$encode = mb_detect_encoding($users, 'UTF-8', true);
if(!$encode){
	$temp = iconv("gbk","utf-8", $users);
	if($temp) $users = $temp;
}

$user = explode(",",$users);

echo '<table border="1">';
echo "<tr><th></th><th></th>";
for($i=0; $i<$pnum; $i++){
	echo '<th><a href=problem.php?id='.$pid[$i].' target=_blank>'.$pid[$i]."</a></th>";
}
echo "</tr>";
$i = 0;
while(strlen($user[$i])>8){
	$name = substr($user[$i], 0, strpos($user[$i], ' '));
	$id = substr($user[$i], strpos($user[$i], ' ')+1);

	//echo $user[$i]."<br>";
	//echo $name."<br>";
	//$id = intval($user[$i]);
	//echo $id."<br>";
	//$sql = "update crx_users set nick = '$name' where user_id like '%$id%'";
	//mysql_query($sql);
	$sql = "select DISTINCT `problem_id` from solution where `result` = 4 and `user_id` like '%$id%'";
	if($in) $sql = $sql . "and problem_id in($in)";
	$result = mysqli_query($mysqli,$sql);
	$pids = '';
	while ($row=mysqli_fetch_array($result)){
		$pids = $pids . ' {' . $row[0] . '} ';
	}
	echo "<tr><td>$name</td><td><a href= userinfo.php?user=$id>$id</a></td>";
	for($j=0; $j<$pnum; $j++){
		$temp = '{' . $pid[$j] . '}';
		if(strpos($pids, $temp)) echo "<td>1</td>";
		else echo "<td bgcolor = 'red'>0</td>";
	}
	echo "</tr>";
	$i++;
}
echo "</table>";
	//die($pid[5].$pnum);

?>